select 
        O.VDAT
        ,O.S
        ,O.REF
        ,O.NAZN
        ,SUBSTR (
            REGEXP_SUBSTR (
                O.NAZN
                ,'№[A-ZА-ЯІЇЄ]+[0-9]*'
            )
            ,2
        ) SER
        ,REGEXP_SUBSTR (
            REGEXP_SUBSTR (
                O.NAZN
                ,'[0-9]+ від'
            )
            ,'[0-9]+'
        ) N
    FROM
oper o
where
 REGEXP_LIKE (
            O.NAZN
            ,'^(\W|\w)*№[A-ZА-ЯІЇЄ]+[0-9]+\sвід\s[0-9]{2}\S[0-9]{2}\S[0-9]{4}'
        )
        
        and rownum < 10
        
/*
          REF	                                                                                                                       NAZN		    SER	N
|	Сплата за друкування листівок зг.дог.№ОР260315 від 26.03.2015р. рах.№ 361 від 30.03.2015р.В т.ч.ПДВ-106,67грн.	            |	ОР260315	| 260315
|	Зарахування на  картрахунок зг.сл.розп.№15 від 4,02,2015р.надлишки при розв.АТМ №А0902243 від 26,01,2015р.	                |	А0902243	| 15
|	Проплта за отриманий товар зг.накл.№РНК88201 від 10.12.2014р. В т.ч.ПДВ 33,33грн.	                                        |	РНК88201	| 88201
|	Аптека.Кирп.За вироби медичного призначення згідно договору №К120 від 02.04.2012р. у т.ч. ПДВ 7% -339,43 грн.	            |	К120	    | 120
|	у маслі газів, згідно рах.№КЕ000002267 від 23.03.2015р.,дог.№33/52-р від 12.02.2015р.  в т.ч. ПДВ 20% - 875.49	            |	КЕ000002267	| 000002267
|	К.За продукти харчування згідно договору №С00000530 від 26.03.2012р. у т.ч. ПДВ 20% - 6522.00 грн.	                        |	С00000530	| 00000530
|	Оплата за таблички,згідно рахунку №ОО000000005 від 12,01,2015р.Без тенд В т.ч. ПДВ 606,67 грн.	                            |	ОО000000005	| 000000005
|	Платіж за ел.енергію за БЕРЕЗЕНЬ 2015 р.зг акту №А-8019129686 ,Дог.№Т064 від 15.05.1998 від ФОП На	                        |	А	        | 064
|	Оплата за надані послуги згідно рах.№СЗ00160324 від 26.03.2015р. в т.ч. ПДВ 20% - 60.41 грн.	                            |	СЗ00160324	| 00160324
    